{
  "title": "Featured Projects",
  "subtitle": "A selection of real client work and personal projects that show how I design, build, and ship web applications with React, Next.js, and modern tooling.",
  "otherProjects": "Other Projects",
  "buttons": {
    "liveDemo": "Live Demo",
    "demo": "Demo",
    "code": "Code",
    "viewAllGithub": "View All Projects on GitHub"
  },
  "projectsList": {
    "haus": {
      "title": "Haus – Financial Health App (Swirl)",
      "description": "Haus is a financial health web app used by Brazilian users to assess their finances and find suitable solutions. Built at Swirl during my frontend internship, where I implemented key UI flows in Next.js and integrated them with Neon and Vercel deployments."
    },
    "autothread": {
      "title": "AutoThread Generator",
      "description": "Many creators struggle to turn ideas into consistent Twitter threads. I built an AI-powered web app that takes a topic and tone, generates a full thread with the Google Gemini API, and lets users post it to Twitter in one click, practicing auth, API integration, and motion UI."
    },
    "musicSchool": {
      "title": "Music School App",
      "description": "Small music schools often need a simple way to present their courses and stand out online. I designed and built a modern marketing site with Next.js, Acertainity UI, and Tailwind CSS, focusing on clean layout, animations, and fully responsive sections."
    },
    "moneymate": {
      "title": "MoneyMate App",
      "description": "People need a simple way to track everyday expenses. I built a full-stack MERN expense tracker with secure login and complete CRUD for transactions in a clean dashboard."
    },
    "anonymousInbox": {
      "title": "Anonymous Inbox",
      "description": "Sharing honest feedback can be hard when identity is visible. This app lets users send and receive anonymous messages using Next.js (App Router), MongoDB, and NextAuth, focusing on a minimal, privacy-first experience."
    },
    "hyperIsland": {
      "title": "Hyper Island Evolution",
      "description": "Many portfolios are flat; this WebXR experience invites users into an interactive 3D journey. Built with A‑Frame, it showcases custom VR interactions and animated scenes in the browser."
    },
    "todoApp": {
      "title": "Todo App with Redux Toolkit",
      "description": "Managing state in growing apps can quickly become messy. This to‑do list app uses Redux Toolkit slices and async thunks to practice predictable state management in a small, focused project."
    },
    "cocktailApp": {
      "title": "Cocktail Kungen App",
      "description": "Users want to quickly explore new cocktails without reading long blogs. This app consumes TheCocktailDB API to search and filter recipes with a simple React + Context state layer."
    },
    "ticTacToe": {
      "title": "Tic Tac Toe Game",
      "description": "Classic games are a great way to practice core JavaScript. This Tic Tac Toe implementation focuses on clean game logic and a simple, accessible UI with HTML, CSS, and JavaScript."
    }
  }
}
