{
  "title": "Utvalda projekt",
  "subtitle": "Ett urval av verkligt kundarbete och personliga projekt som visar hur jag designar, bygger och levererar webbapplikationer med React, Next.js och moderna verktyg.",
  "otherProjects": "Andra projekt",
  "buttons": {
    "liveDemo": "Live Demo",
    "demo": "Demo",
    "code": "Kod",
    "viewAllGithub": "Visa alla projekt på GitHub"
  },
  "projectsList": {
    "haus": {
      "title": "Haus – Finansiell Hälsoapp (Swirl)",
      "description": "Haus är en finansiell hälsowebbapp som används av brasilianska användare för att bedöma sin ekonomi och hitta lämpliga lösningar. Byggd på Swirl under min frontend-praktik, där jag implementerade viktiga UI-flöden i Next.js och integrerade dem med Neon- och Vercel-distributioner."
    },
    "autothread": {
      "title": "AutoThread Generator",
      "description": "Många kreatörer kämpar med att förvandla idéer till konsekventa Twitter-trådar. Jag byggde en AI-driven webbapp som tar ett ämne och ton, genererar en fullständig tråd med Google Gemini API och låter användare posta den till Twitter med ett klick, övade autentisering, API-integration och rörelse-UI."
    },
    "musicSchool": {
      "title": "Music School App",
      "description": "Små musikskolor behöver ofta ett enkelt sätt att presentera sina kurser och sticka ut online. Jag designade och byggde en modern marknadsföringswebbplats med Next.js, Acertainity UI och Tailwind CSS, med fokus på ren layout, animationer och helt responsiva sektioner."
    },
    "moneymate": {
      "title": "MoneyMate App",
      "description": "Människor behöver ett enkelt sätt att spåra vardagliga utgifter. Jag byggde en fullstack MERN-utgiftsspårare med säker inloggning och fullständig CRUD för transaktioner i en ren instrumentpanel."
    },
    "anonymousInbox": {
      "title": "Anonym Inkorg",
      "description": "Att dela ärlig feedback kan vara svårt när identiteten är synlig. Denna app låter användare skicka och ta emot anonyma meddelanden med Next.js (App Router), MongoDB och NextAuth, med fokus på en minimal, integritetsfokuserad upplevelse."
    },
    "hyperIsland": {
      "title": "Hyper Island Evolution",
      "description": "Många portföljer är platta; denna WebXR-upplevelse bjuder in användare till en interaktiv 3D-resa. Byggd med A‑Frame, visar den anpassade VR-interaktioner och animerade scener i webbläsaren."
    },
    "todoApp": {
      "title": "Todo-app med Redux Toolkit",
      "description": "Att hantera tillstånd i växande appar kan snabbt bli rörigt. Denna att-göra-listapp använder Redux Toolkit-skivor och asynkrona thunks för att öva förutsägbar tillståndshantering i ett litet, fokuserat projekt."
    },
    "cocktailApp": {
      "title": "Cocktail Kungen App",
      "description": "Användare vill snabbt utforska nya cocktails utan att läsa långa bloggar. Denna app konsumerar TheCocktailDB API för att söka och filtrera recept med ett enkelt React + Context-tillståndslager."
    },
    "ticTacToe": {
      "title": "Luffarschack-spel",
      "description": "Klassiska spel är ett bra sätt att öva kärn-JavaScript. Denna Luffarschack-implementering fokuserar på ren spellogik och ett enkelt, tillgängligt UI med HTML, CSS och JavaScript."
    }
  }
}
